PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_scb_i2c.h
/***************************************************************************//**
* \file cy_scb_i2c.h
* \version 3.30
*
* Provides I2C API declarations of the SCB driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2025 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_scb_i2c
* \{
* Driver API for I2C Bus Peripheral
*
* I2C - The Inter-Integrated Circuit (I2C) bus is an industry-standard.
*
* The functions and other declarations used in this part of the driver are in
* cy_scb_i2c.h. You can also include cy_pdl.h to get access
* to all functions and declarations in the PDL.
*
* The I2C peripheral driver provides an API to implement I2C slave, master,
* or master-slave devices based on the SCB hardware block.
* I2C devices based on SCB hardware are compatible with I2C
* Standard-mode, Fast-mode, and Fast-mode Plus specifications as defined in
* the I2C-bus specification.
*
* Features:
* * An industry-standard I2C bus interface
* * Supports slave, master, and master-slave operation
* * Supports standard data rates of 100/400/1000 kbps
* * Hardware Address Match, multiple addresses
* * Wake from Deep Sleep on Address Match
*
* \note
* I2C supports clock stretching. This occurs when a slave device is not capable
* of processing data, it holds the SCL line by driving a '0'. The master device monitors
* the SCL line and detects it when it cannot generate a positive clock pulse ('1') on the
* SCL line. It then reacts by delaying the generation of a positive edge on the SCL line,
* effectively synchronizing with the slave device that is stretching the clock.
* Clock stretching can occur in the case of externally clocked address matching until the
* internally clocked logic takes over. The largest reason for clock stretching is when the
* master tries to write to the slave and the slave's RX FIFO is full, the slave will then
* clock stretch until the FIFO is no longer full. For more information on FIFO size and clock
* stretching see the architecture TRM.
********************************************************************************
* \section group_scb_i2c_configuration Configuration Considerations
********************************************************************************
* The I2C driver configuration can be divided to number of sequential
* steps listed below:
* * \ref group_scb_i2c_config
* * \ref group_scb_i2c_pins
* * \ref group_scb_i2c_clock
* * \ref group_scb_i2c_data_rate
*   * \ref group_scb_i2c_mclk_sync
* * \ref group_scb_i2c_intr
* * \ref group_scb_i2c_enable
*
* \note
* I2C driver is built on top of the SCB hardware block. The SCB3 instance is
* used as an example for all code snippets. Modify the code to match your
* design.
*
********************************************************************************
* \subsection group_scb_i2c_config Configure I2C
********************************************************************************
* To set up the I2C  driver, provide the configuration parameters in the
* \ref cy_stc_scb_i2c_config_t structure. Provide i2cMode to the select
* operation mode slave, master or master-slave. The useRxFifo and useTxFifo
* parameters specify if RX and TX FIFO is used during operation. Typically, both
* FIFOs should be enabled to reduce possibility of clock stretching. However,
* using RX FIFO has side effects that needs to be taken into account
* (see useRxFifo field description in \ref cy_stc_scb_i2c_config_t structure).
* For master modes, parameters lowPhaseDutyCycle, highPhaseDutyCycle and
* enableDigitalFilter can be used to define output data rate (refer to section
* \ref group_scb_i2c_data_rate for more information).
* For slave mode, provide the slaveAddress and slaveAddressMask. The other
* parameters are optional for operation.\n
* To initialize the driver, call \ref Cy_SCB_I2C_Init
* function providing a pointer to the populated \ref cy_stc_scb_i2c_config_t
* structure and the allocated \ref cy_stc_scb_i2c_context_t structure.
*
* \snippet scb/i2c_snippet/main.c I2C_CFG
*
* Set up I2C slave read and write buffer before enabling its
* operation using \ref Cy_SCB_I2C_SlaveConfigReadBuf and \ref
* Cy_SCB_I2C_SlaveConfigWriteBuf appropriately. Note that the master reads
* data from the slave read buffer and writes data into the slave write buffer.
*
* \snippet scb/i2c_snippet/main.c I2C_CFG_BUFFER
*
********************************************************************************
* \subsection group_scb_i2c_pins Assign and Configure Pins
********************************************************************************
* Only dedicated SCB pins can be used for I2C operation. The HSIOM
* register must be configured to connect dedicated SCB I2C pins to the
* SCB block. Also the I2C pins must be configured in Open-Drain, Drives Low mode
* (this pins  configuration implies usage of external pull-up resistors):
*
* \snippet scb/i2c_snippet/main.c I2C_CFG_PINS
*
* \note
* The alternative pins configuration is Resistive Pull-ups which implies usage
* internal pull-up resistors. This configuration is not recommended because
* resistor value is fixed and cannot be used for all supported data rates.
* Refer to the device datasheet parameter RPULLUP for resistor value specifications.
*
********************************************************************************
* \subsection group_scb_i2c_clock Assign Clock Divider
********************************************************************************
* A clock source must be connected to the SCB block to oversample input and
* output signals, in this document this clock will be referred as clk_scb.
* You must use one of the 8-bit or 16-bit dividers. Use the \ref group_sysclk
* driver API to do this.
*
* \snippet scb/i2c_snippet/main.c I2C_CFG_ASSIGN_CLOCK
*
********************************************************************************
* \subsection group_scb_i2c_data_rate Configure Data Rate
********************************************************************************
* To get I2C slave operation with the desired data rate, the clk_scb must be
* fast enough to provide sufficient oversampling. Use the
* \ref group_sysclk driver API to do this.
*
* \snippet scb/i2c_snippet/main.c I2C_CFG_DATA_RATE_SLAVE
*
* To get I2C master operation with the desired data rate, the source clock
* frequency and SCL low and high phase duration must be configured. Use the
* \ref group_sysclk driver API to configure source clock frequency. Then call
* \ref Cy_SCB_I2C_SetDataRate to set the SCL low, high phase duration and
* digital filter. This function sets SCL low and high phase settings based on
* source clock frequency.
*
* \snippet scb/i2c_snippet/main.c I2C_CFG_DATA_RATE_MASTER
*
* Alternatively, the low, high phase and digital filter can be set directly
* using configuration structure \ref cy_stc_scb_i2c_config_t fields
* lowPhaseDutyCycle, highPhaseDutyCycle and enableDigitalFilter appropriately.\n
* <b>Refer to the technical reference manual (TRM) section I2C sub-section
* Oversampling and Bit Rate to get information how to configure I2C to run with
* the desired data rate.</b>
*
* \note
* For I2C slave, the analog filter is used for all supported data rates. \n
* For I2C master, the analog filter is used for Standard and Fast modes and the
* digital filter for Fast Plus mode.
*
********************************************************************************
* \subsection group_scb_i2c_intr Configure Interrupt
********************************************************************************
* The interrupt is mandatory for I2C operation. The exception is the when only
* the \ref group_scb_i2c_master_low_level_functions functions are used.
* The driver provides three interrupt functions: \ref Cy_SCB_I2C_Interrupt,
* \ref Cy_SCB_I2C_SlaveInterrupt, and \ref Cy_SCB_I2C_MasterInterrupt. One of
* these functions must be called in the interrupt handler for the selected SCB
* instance. Call \ref Cy_SCB_I2C_SlaveInterrupt when I2C is configured to
* operate as a slave, \ref Cy_SCB_I2C_MasterInterrupt when I2C is configured
* to operate as a master and \ref Cy_SCB_I2C_Interrupt when I2C is configured
* to operate as master and slave. Using the slave- or master-specific interrupt
* function allows reducing the flash consumed by the I2C driver. Also this
* interrupt must be enabled in the NVIC otherwise it will not work.
* \note
* The I2C driver documentation refers to the \ref Cy_SCB_I2C_Interrupt function
* when interrupt processing is mandatory for the operation. This is done to
* simplify the readability of the driver's documentation. The application should
*  call the slave- or master-specific interrupt functions \ref Cy_SCB_I2C_SlaveInterrupt
* or \ref Cy_SCB_I2C_MasterInterrupt, when appropriate.
*
* \snippet scb/i2c_snippet/main.c I2C_INTR_A
* \snippet scb/i2c_snippet/main.c I2C_INTR_B
*
********************************************************************************
* \subsection group_scb_i2c_enable Enable I2C
********************************************************************************
* Finally, enable the I2C operation by calling \ref Cy_SCB_I2C_Enable. Then I2C
* slave starts respond to the assigned address and I2C master ready to execute
* transfers.
*
* \snippet scb/i2c_snippet/main.c I2C_ENABLE
*
* \section group_scb_i2c_use_cases Common Use Cases
*
********************************************************************************
* \subsection group_scb_i2c_master_mode Master Operation
********************************************************************************
* The master API is divided into two categories:
* \ref group_scb_i2c_master_high_level_functions and
* \ref group_scb_i2c_master_low_level_functions. Therefore, there are two
* methods for initiating I2C master transactions using either <b>Low-Level or
* High-Level</b> API. These two methods are described below. Only one method
* should be used at a time. <b>They should not be mixed.</b>
*
********************************************************************************
* \subsubsection  group_scb_i2c_master_hl Use High-Level Functions
********************************************************************************
*  Call \ref Cy_SCB_I2C_MasterRead or \ref Cy_SCB_I2C_MasterWrite to
* communicate with the slave. These functions do not block and only start a
* transaction. After a transaction starts, the \ref Cy_SCB_I2C_Interrupt
* handles further data transaction until its completion (successfully or
* with error occurring). To monitor the transaction,
* use \ref Cy_SCB_I2C_MasterGetStatus or register callback function using
* \ref Cy_SCB_I2C_RegisterEventCallback to be notified about
* \ref group_scb_i2c_macros_callback_events.
*
* \snippet scb/i2c_snippet/main.c I2C_MASTER_WRITE_READ_INT
*
********************************************************************************
* \subsubsection group_scb_i2c_master_ll Use Low-Level Functions
********************************************************************************
* Call \ref Cy_SCB_I2C_MasterSendStart to generate a start, send an address
* with the Read/Write direction bit, and receive acknowledgment. After the
* address is ACKed by the slave, the transaction can be continued by calling
* \ref Cy_SCB_I2C_MasterReadByte or \ref Cy_SCB_I2C_MasterWriteByte depending
* on its direction. These functions handle one byte per call. Therefore,
* they should be called for each byte in the transaction. Note that for the
* Read transaction, the last byte must be NAKed. To complete the current
* transaction, call \ref Cy_SCB_I2C_MasterSendStop or call
* \ref Cy_SCB_I2C_MasterSendReStart to complete the current transaction and
* start a new one. Typically, do a restart to change the transaction
* direction without releasing the bus from the master control.
* The Low-Level functions are blocking and do not require calling
* \ref Cy_SCB_I2C_Interrupt inside the interrupt handler. Using these
* functions requires extensive knowledge of the I2C protocol to execute
* transactions correctly.
*
* <b>Master Write Operation</b>
* \snippet scb/i2c_snippet/main.c I2C_MASTER_WRITE_MANUAL
*
* <b>Master Read Operation</b>
* \snippet scb/i2c_snippet/main.c I2C_MASTER_READ_MANUAL
*
********************************************************************************
* \subsection group_scb_i2c_slave Slave Operation
********************************************************************************
* Slave operation requires the \ref Cy_SCB_I2C_Interrupt be
* called inside the interrupt handler. The read and write buffers must
* be provided for the slave to enable communication with the master. Use
* \ref Cy_SCB_I2C_SlaveConfigReadBuf and \ref Cy_SCB_I2C_SlaveConfigWriteBuf
* for this purpose. Note that after transaction completion the buffer must be
* configured again. Otherwise, the same buffer is used starting from the point
* where the master stopped a previous transaction.
* For example: The read buffer is configured to be 10 bytes and the master reads
* 8 bytes. If the read buffer is not configured again, the next master read
* will start from the 9th byte.
* To monitor the transaction status, use \ref Cy_SCB_I2C_SlaveGetStatus or
* use \ref Cy_SCB_I2C_RegisterEventCallback to register a callback function
* to be notified about \ref group_scb_i2c_macros_callback_events.
*
* <b>Get Slave Events Notification</b>
* \snippet scb/i2c_snippet/main.c I2C_SLAVE_REG_CALLBACK
* \snippet scb/i2c_snippet/main.c I2C_SLAVE_NOTIFICATION
*
* <b>Polling Slave Completion Events</b>
* \snippet scb/i2c_snippet/main.c I2C_SLAVE_POLLING
*
* \note
* All slave API (except \ref Cy_SCB_I2C_SlaveAbortRead and
* \ref Cy_SCB_I2C_SlaveAbortWrite) <b>are not interrupt-protected</b> and to
* prevent a race condition, they should be protected from the I2C interruption
* in the place where they are called. The code snippet Polling Slave
* Completion Events above shows how to prevent a race condition when detect
* transfer completion and update I2C slave write buffer.
* The simple example of race condition is: application updates slave read
* buffer the I2C master starts read transfer. The I2C interrupts read buffer
* update and I2C interrupt loads current read buffer content in the TX FIFO .
* After I2C interrupt returns the application updates remaining part of the read
* buffer. As a result the mater read partly updated buffer.
*
********************************************************************************
* \section group_scb_i2c_lp Low Power Support
********************************************************************************
* The I2C driver provides callback functions to handle power mode transition.
* The callback \ref Cy_SCB_I2C_DeepSleepCallback must be called
* during execution of \ref Cy_SysPm_CpuEnterDeepSleep \ref Cy_SCB_I2C_HibernateCallback
* must be called during execution of \ref Cy_SysPm_SystemEnterHibernate. To trigger the
* callback execution, the callback must be registered before calling the
* power mode transition function. Refer to \ref group_syspm driver for more
* information about power mode transitions and callback registration.
*
* \note
* Only applicable for <b>rev-08 of the CY8CKIT-062-BLE</b>.
* For proper operation, when the I2C slave is configured to be a wakeup
* source from Deep Sleep mode, the \ref Cy_SCB_I2C_DeepSleepCallback must be
* copied and modified. Refer to the function description to get the details.
*
* \defgroup group_scb_i2c_macros Macros
* \defgroup group_scb_i2c_functions Functions
* \{
* \defgroup group_scb_i2c_general_functions General
* \defgroup group_scb_i2c_slave_functions Slave
* \defgroup group_scb_i2c_master_high_level_functions Master High-Level
* \defgroup group_scb_i2c_master_low_level_functions Master Low-Level
* \defgroup group_scb_i2c_interrupt_functions Interrupt
* \defgroup group_scb_i2c_low_power_functions Low Power Callbacks
* \}
* \defgroup group_scb_i2c_data_structures Data Structures
* \defgroup group_scb_i2c_enums Enumerated Types
*/

#if !defined(CY_SCB_I2C_H)
#define CY_SCB_I2C_H

